package cn.itcast.day05.demo01;

/**
 * 使用静态初始化数组的时候，格式还可以省略一下
 * 标准格式：
 * 数据类型[] 数组名称 = new 数据类型[]{元素1，元素2，。。};
   省略格式：
 * 数据类型[] 数组名称 ={元素1，元素2，。。};
 * 注意事项：
 * 1.静态初始化没有指定长度，但是仍然会自动计算得到长度；
 * 2.静态初始化标准格式可以拆分两个步骤。
 * 3.动态初始化标准格式可以拆分两个步骤。
 * 4.静态初始化一旦使用哦省略格式，就不能拆分格式了。
 *
 * 使用建议：（4.什么时候用？）
 * 如果不确定数组当中的具体内容，使用动态初始化。
 * 已经确定了具体内容，用静态初始化。
 *
 */
public class Demo03Array {
    public static void main(String[] args) {
        //省略格式静态初始化
        int[] arrayA = {10,20,30};
        // * 2.静态初始化标准格式可以拆分两个步骤。
        int[] arrayB;
        arrayB = new int[]{11,22,33};
        // * 2.动态初始化标准格式可以拆分两个步骤。
        int[] arrayC;
        arrayC = new int[5];
    }
}
